# Составьте аббревиатуру из первых букв слов.
# Однобуквенные слова нужно пропустить независимо от регистра.
# Результат выведите прописными буквами.
#
# Пример: 'Белорусский государственный университет информатики и радиоэлектроники' → 'БГУИР'.

phrase = input("Введите фразу, из которой нужно сделать аббревиатуру:\n")
phrase_new = phrase.split(" ")
new_list = ""
print(phrase_new)

for num in phrase_new:
    if len(num) > 1:
        new_list += num[0:1]
        new_list = new_list.upper()
        
        
print(new_list)       