# Найдите в тексте все хештеги.
# Хештег начинается с `#` и содержит после него хотя бы одну букву, цифру или символ `_`.
# Любой другой символ завершает хештег.
# Выведите найденные хештеги без повторов в порядке появления.

# Пример: 'Учимся с #Python, пишем #код и снова #Python!' → '#Python #код'.

text = 'Учимся с #Python, пишем #код и снова #Python!'
text = text.split()
new_text = ""
s = []
for num in text:
    if "#" in num:
       s = num.rstrip("/*-+<>,./?!@#$%^&*()")
       if s not in new_text:
           new_text.append

print(new_text)
