# Пользователь вводит белорусский номер телефона в произвольном оформлении.
# Пробелы, скобки и дефисы разрешены, но должны быть удалены.
# После очистки номер должен состоять из записи `+375` и ещё 9 цифр.
# Любые другие символы делают номер некорректным.
#
# Пример: '(29) 123-45-67' → '+375291234567'; '29-123-456-789` → некорректный номер.

phone = input("Введите номер телефона: ")
phone_new = "+375"
count = 0
valid = True
for num in phone:
    if num.isnumeric():
        phone_new += num
        count += 1
    elif num in ("(", ")"," ", "-"):
        continue
    else:
        valid = False
        break
if count == 9 and valid:
    print(phone_new)
else:
    print("некорректный номер")

    



        